Revit 2018 API
FabricationConfigurationInfo Class
 Represents an MEP object that holds the properties of an MEP fabrication configuration.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2016
Syntax
C#
public class FabricationConfigurationInfo : IDisposable
Visual Basic
Public Class FabricationConfigurationInfo _
	Implements IDisposable
Visual C++
public ref class FabricationConfigurationInfo : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FabricationConfigurationInfo
See Also
FabricationConfigurationInfo Members
Autodesk.Revit.DB Namespace